In [21]:
import pandas as pd
import sqlite3

In [22]:
sql.version

'2.6.0'

## create a connecttion to sqlite3

In [24]:
db = 'datasheet/demo2.sqlite'
con = sqlite3.connect(db)

##  list all table name from sqlite database

In [25]:
sql = """ select*from sqlite_master where type= 'table'"""    #ดููตารางทุกตัวใน sql = select*from sqlite_master
df = pd.read_sql(sql, con)
df

,type,name,tbl_name,rootpage,sql
0,table,t1,t1,2,"CREATE TABLE t1(id integer primary key, name t..."
1,table,t2,t2,3,"CREATE TABLE t2(id int, name char, age int)"

In [28]:
sql = """ select* from t2 limit 10 """
df = pd.read_sql(sql, con)
df

   id      name  age
0   1  Rujikorn   20
1   2  Kittisak   20
2   3   Parinya   20

In [30]:
sql = """ select*from t1 """
df = pd.read_sql(sql, con)
df

   id  name nickname  age
0  55   tan    bored   12
1  58  Gose     gogo   20